{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_39/kernel", "shape": [4, 4, 1, 32], "dtype": "float32"}, {"name": "conv2d_39/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_36/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_36/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_36/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_36/moving_variance", "shape": [14], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "conv2d_40/kernel", "shape": [2, 2, 14, 32], "dtype": "float32"}, {"name": "conv2d_40/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_37/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_37/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_37/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_37/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "conv2d_41/kernel", "shape": [2, 2, 32, 32], "dtype": "float32"}, {"name": "conv2d_41/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_38/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_38/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_38/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_38/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "dense_25/kernel", "shape": [3584, 256], "dtype": "float32"}, {"name": "dense_25/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_39/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "dense_26/kernel", "shape": [256, 7], "dtype": "float32"}, {"name": "dense_26/bias", "shape": [7], "dtype": "float32"}]}]}