{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_26", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 28, 28], "name": "input_26", "sparse": false}}, {"inbound_nodes": [[["input_26", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_39", "config": {"dilation_rate": [1, 1], "padding": "same", "strides": [2, 2], "data_format": "channels_first", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 32, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [4, 4], "use_bias": true, "trainable": true, "name": "conv2d_39", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_39", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_36", "config": {"gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "name": "batch_normalization_36", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_40", "config": {"dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 32, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [2, 2], "use_bias": true, "trainable": true, "name": "conv2d_40", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_40", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_37", "config": {"gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "name": "batch_normalization_37", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_41", "config": {"dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 32, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_size": [2, 2], "use_bias": true, "trainable": true, "name": "conv2d_41", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_41", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_38", "config": {"gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "name": "batch_normalization_38", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"inbound_nodes": [[["batch_normalization_38", 0, 0, {}]]], "class_name": "Activation", "name": "activation_22", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_14", "config": {"name": "max_pooling2d_14", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_26", "config": {"trainable": true, "rate": 0.25, "name": "dropout_26", "noise_shape": null, "seed": null}}, {"inbound_nodes": [[["dropout_26", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_14", "config": {"trainable": true, "name": "flatten_14", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_14", 0, 0, {}]]], "class_name": "Dense", "name": "dense_25", "config": {"bias_regularizer": null, "activation": "linear", "units": 256, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "name": "dense_25"}}, {"inbound_nodes": [[["dense_25", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_39", "config": {"gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "name": "batch_normalization_39", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]], "class_name": "Activation", "name": "activation_23", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_27", "config": {"trainable": true, "rate": 0.25, "name": "dropout_27", "noise_shape": null, "seed": null}}, {"inbound_nodes": [[["dropout_27", 0, 0, {}]]], "class_name": "Dense", "name": "dense_26", "config": {"bias_regularizer": null, "activation": "softmax", "units": 7, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "name": "dense_26"}}], "output_layers": [["dense_26", 0, 0]], "name": "model_10", "input_layers": [["input_26", 0, 0]]}}, "training_config": {"sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"amsgrad": false, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "decay": 0.0}}, "metrics": ["accuracy"], "loss_weights": null, "loss": "categorical_crossentropy"}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_36/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_36/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_36/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_36/moving_variance", "shape": [14], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_37/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_37/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_37/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_37/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_38/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_38/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_38/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_38/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_39/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "conv2d_39/kernel", "shape": [4, 4, 1, 32], "dtype": "float32"}, {"name": "conv2d_39/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "conv2d_40/kernel", "shape": [2, 2, 14, 32], "dtype": "float32"}, {"name": "conv2d_40/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv2d_41/kernel", "shape": [2, 2, 32, 32], "dtype": "float32"}, {"name": "conv2d_41/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "dense_25/kernel", "shape": [3584, 256], "dtype": "float32"}, {"name": "dense_25/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "dense_26/kernel", "shape": [256, 7], "dtype": "float32"}, {"name": "dense_26/bias", "shape": [7], "dtype": "float32"}]}]}